ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.c
/***************************************************************************//**
* \file cy_ble_gap.c
* \version 2.0
*
* \brief
*  This file contains the source code for the GAP API of the BLE Component.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"
/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE)

#include "cy_ble_hal_pvt.h"
#include <stdlib.h>

/***************************************
* Function Prototypes
***************************************/

#if (CY_BLE_GATT_ROLE_SERVER)
    #if (CY_BLE_GAP_ROLE_PERIPHERAL)
static void Cy_BLE_ChangeAdLocalName(const char8 name[], uint8_t dest);
    #endif /* (CY_BLE_GAP_ROLE_PERIPHERAL) */
#endif     /* (CY_BLE_GATT_ROLE_SERVER) */


/***************************************
* Global Variables
***************************************/

cy_en_ble_state_t cy_ble_state;

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
cy_en_ble_adv_state_t cy_ble_advState;
uint8_t cy_ble_advIndex;
#endif  /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */

#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
cy_en_ble_scan_state_t cy_ble_scanState;
uint8_t cy_ble_scanIndex;
#endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER) */

#if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL))

/* This global variable is initialized after connection with peer device,
 * after CY_BLE_EVT_GATT_CONNECT_IND event, and could be used by application code
 * to send data to peer device.
 */
cy_stc_ble_conn_handle_t cy_ble_connHandle[CY_BLE_CONN_COUNT];
cy_en_ble_conn_state_t cy_ble_connState[CY_BLE_CONN_COUNT];

#if (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES)
uint8_t cy_ble_peerBonding[CY_BLE_CONN_COUNT];
uint8_t cy_ble_pendingFlashWrite;

#if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
static uint8_t cy_ble_pendingFlashClearCccdHandle;
#endif /* CY_BLE_GATT_DB_CCCD_COUNT != 0u */

#endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
#endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

#if (CY_BLE_GAP_ROLE_CENTRAL)

cy_stc_ble_gapc_conn_info_t cy_ble_connectionParameters;

/* Connecting timeout is set to 30 seconds in Cy_BLE_Init function.
 * Not zero value starts timer in Cy_BLE_GAPC_ConnectDevice().
 */
cy_stc_ble_timer_info_t cy_ble_connectingTimeout;

#endif /* CY_BLE_GAP_ROLE_CENTRAL */

cy_stc_ble_gap_bd_addr_t * cy_ble_sflashDeviceAddress = CY_BLE_SFLASH_DEVICE_ADDRESS_PTR;


/******************************************************************************
* Function Name: Cy_BLE_ServiceInit
***************************************************************************//**
*
*  Initializes all included services.
*
* \return
*  None
*
******************************************************************************/
void Cy_BLE_ServiceInit(void)
{
    #if (CY_BLE_GATT_ROLE_CLIENT)
    uint32_t idx;
    for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
    {
        /* Check service range before clearing to support partial discovery */
        if(cy_ble_serverInfo[idx][CY_BLE_SRVI_GAP].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            (void)memset(&cy_ble_discovery[idx].gapc, 0, sizeof(cy_stc_ble_gapc_t));

            /* Initialize UUID  */
            cy_ble_serverInfo[idx][CY_BLE_SRVI_GAP].uuid = CY_BLE_UUID_GAP_SERVICE;
        }

        /* Check service range before clearing to support partial discovery */
        if(cy_ble_serverInfo[idx][CY_BLE_SRVI_GATT].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            (void)memset(&cy_ble_discovery[idx].gattc, 0, sizeof(cy_stc_ble_gattc_t));

            /* Initialize UUID  */
            cy_ble_serverInfo[idx][CY_BLE_SRVI_GATT].uuid = CY_BLE_UUID_GATT_SERVICE;
        }

        #ifdef CY_BLE_IPSS_CLIENT
        cy_ble_serverInfo[idx][CY_BLE_SRVI_IPSS].uuid = CY_BLE_UUID_INTERNET_PROTOCOL_SUPPORT_SERVICE;
        #endif /* CY_BLE_IPSS_CLIENT */
    }
    #endif     /* CY_BLE_GATT_ROLE_CLIENT */

    #ifdef CY_BLE_ANCS
    (void)Cy_BLE_ANCS_Init(&cy_ble_ancsConfig);
    #endif /* CY_BLE_ANCS */

    #ifdef CY_BLE_ANS
    (void)Cy_BLE_ANS_Init(&cy_ble_ansConfig);
    #endif /* CY_BLE_ANS */

    #ifdef CY_BLE_AIOS
    (void)Cy_BLE_AIOS_Init(&cy_ble_aiosConfig);
    #endif /* CY_BLE_AIOS */

    #ifdef CY_BLE_BAS
    (void)Cy_BLE_BAS_Init(&cy_ble_basConfig);
    #endif /* CY_BLE_BAS */

    #ifdef CY_BLE_BCS
    (void)Cy_BLE_BCS_Init(&cy_ble_bcsConfig);
    #endif /* CY_BLE_BCS */

    #ifdef CY_BLE_BLS
    (void)Cy_BLE_BLS_Init(&cy_ble_blsConfig);
    #endif /* CY_BLE_BLS */

    #ifdef CY_BLE_BMS
    (void)Cy_BLE_BMS_Init(&cy_ble_bmsConfig);
    #endif /* CY_BLE_BMS */

    #ifdef CY_BLE_BTS
    (void)Cy_BLE_BTS_Init(&cy_ble_btsConfig);
    #endif /* CY_BLE_BTS */

    #ifdef CY_BLE_CGMS
    (void)Cy_BLE_CGMS_Init(&cy_ble_cgmsConfig);
    #endif /* CY_BLE_CGMS */

    #ifdef CY_BLE_CPS
    (void)Cy_BLE_CPS_Init(&cy_ble_cpsConfig);
    #endif /* CY_BLE_CPS */

    #ifdef CY_BLE_CSCS
    (void)Cy_BLE_CSCS_Init(&cy_ble_cscsConfig);
    #endif /* CY_BLE_CSCS */

    #ifdef CY_BLE_CTS
    (void)Cy_BLE_CTS_Init(&cy_ble_ctsConfig);
    #endif /* CY_BLE_CTS */

    #ifdef CY_BLE_CUSTOM
    (void)Cy_BLE_CUSTOM_Init(&cy_ble_customConfig);
    #endif /* CY_BLE_CUSTOM */

    #ifdef CY_BLE_DIS
    (void)Cy_BLE_DIS_Init(&cy_ble_disConfig);
    #endif /* CY_BLE_DIS */

    #ifdef CY_BLE_ESS
    (void)Cy_BLE_ESS_Init(&cy_ble_essConfig);
    #endif /* CY_BLE_ESS */

    #ifdef CY_BLE_GLS
    (void)Cy_BLE_GLS_Init(&cy_ble_glsConfig);
    #endif /* CY_BLE_GLS */

    #ifdef CY_BLE_HIDS
    (void)Cy_BLE_HIDS_Init(&cy_ble_hidsConfig);
    #endif /* CY_BLE_HIDS */

    #ifdef CY_BLE_HPS
    (void)Cy_BLE_HPS_Init(&cy_ble_hpsConfig);
    #endif /* CY_BLE_HPS */

    #ifdef CY_BLE_HRS
    (void)Cy_BLE_HRS_Init(&cy_ble_hrsConfig);
    #endif /* CY_BLE_HRS */

    #ifdef CY_BLE_HTS
    (void)Cy_BLE_HTS_Init(&cy_ble_htsConfig);
    #endif /* CY_BLE_RSCS */

