ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.c
    #ifdef CY_BLE_IAS
    (void)Cy_BLE_IAS_Init(&cy_ble_iasConfig);
    #endif /* CY_BLE_IAS */

    #ifdef CY_BLE_IPS
    (void)Cy_BLE_IPS_Init(&cy_ble_ipsConfig);
    #endif /* CY_BLE_IPS */

    #ifdef CY_BLE_LLS
    (void)Cy_BLE_LLS_Init(&cy_ble_llsConfig);
    #endif /* CY_BLE_LLS */

    #ifdef CY_BLE_LNS
    (void)Cy_BLE_LNS_Init(&cy_ble_lnsConfig);
    #endif /* CY_BLE_LNS */

    #ifdef CY_BLE_NDCS
    (void)Cy_BLE_NDCS_Init(&cy_ble_ndcsConfig);
    #endif /* CY_BLE_NDCS */

    #ifdef CY_BLE_PASS
    (void)Cy_BLE_PASS_Init(&cy_ble_passConfig);
    #endif /* CY_BLE_PASS */

    #ifdef CY_BLE_RSCS
    (void)Cy_BLE_RSCS_Init(&cy_ble_rscsConfig);
    #endif /* CY_BLE_RSCS */

    #ifdef CY_BLE_PLXS
    (void)Cy_BLE_PLXS_Init(&cy_ble_plxsConfig);
    #endif /* CY_BLE_PLXS */

    #ifdef CY_BLE_RTUS
    (void)Cy_BLE_RTUS_Init(&cy_ble_rtusConfig);
    #endif /* CY_BLE_RTUS */

    #ifdef CY_BLE_SCPS
    (void)Cy_BLE_SCPS_Init(&cy_ble_scpsConfig);
    #endif /* CY_BLE_SCPS */

    #ifdef CY_BLE_TPS
    (void)Cy_BLE_TPS_Init(&cy_ble_tpsConfig);
    #endif /* CY_BLE_TPS */

    #ifdef CY_BLE_UDS
    (void)Cy_BLE_UDS_Init(&cy_ble_udsConfig);
    #endif /* CY_BLE_UDS */

    #ifdef CY_BLE_WPTS
    (void)Cy_BLE_WPTS_Init(&cy_ble_wptsConfig);
    #endif /* CY_BLE_WPTS */

    #ifdef CY_BLE_WSS
    (void)Cy_BLE_WSS_Init(&cy_ble_wssConfig);
    #endif /* CY_BLE_WSS */
}


/******************************************************************************
* Function Name: Cy_BLE_StoreAppData
***************************************************************************//**
*
*  This function instructs the Stack to backup application specific data into
*  flash. This API must be called by application to backup application specific
*  data.
*
*  \param param: parameter of type 'cy_stc_ble_app_flash_param_t
*   * param->srcBuff: Source buffer
*   * param->destAddr: Destination address
*   * param->buffLen: Length of srcData
*   * param->writeMode: blocked or non-blocked write mode
*
*  This function works in two write modes: blocked or non-blocked :
*    CY_BLE_STORE_DATA_MODE_BLOCKING (0x00) - the function writes all data from
*       srcBuff and returns CY_BLE_SUCCESS when finish. After writing one rows, 
*       the function calls Cy_BLE_ProcessEvents that allows stack to process 
*       pending events.
*    CY_BLE_STORE_DATA_MODE_NON_BLOCKING (0x01) - the function writes one row 
*       per call and returns CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS when write in 
*       progresing or CY_BLE_SUCCESS, when finish.  Afret writing one rows, the
*       function calls Cy_BLE_ProcessEvents that allows stack to process pending
*       events.
*       Application should keep calling this function till it returns 
*       CY_BLE_SUCCESS. 
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                              | Description
*   ------------                             | -----------
*   CY_BLE_SUCCESS                           | On successful operation
*   CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS      | Write operation in progress
*   CY_BLE_ERROR_INVALID_PARAMETER           | Invalid input parameter
*   CY_BLE_ERROR_FLASH_WRITE                 | Error in flash Write
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_StoreAppData(const cy_stc_ble_app_flash_param_t *param)
{
    static cy_en_ble_api_result_t storeState = CY_BLE_SUCCESS;
    static uint32_t tLength = 0u;

    uint8_t *tSrcPtr   = (uint8_t *) param->srcBuff;
    uint32_t tOffset   = (uint32) param->destAddr - CY_FLASH_BASE;  /* Get offset */
    uint32_t blockSize;      
    bool exitFlag = false;
    
    switch (storeState)
    {           
        case CY_BLE_SUCCESS: 
        case CY_BLE_ERROR_INVALID_PARAMETER:
        case CY_BLE_ERROR_FLASH_WRITE:
            tLength = param->buffLen;
            break;
            
        case CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS:
            if (tLength == 0u)
            {
                storeState = CY_BLE_SUCCESS;
                exitFlag = true;
            }
            else
            {
                /* Restore offset and srcPtr according to length */
                tSrcPtr += param->buffLen - tLength;
                tOffset += param->buffLen - tLength;
            }
            break;
            
       default:
            break;
    }
    
    while((tLength !=0u) && (exitFlag == false))
    {
        /* Split srcBuff into parts of flash row size (512 bytes) */
        blockSize = (tOffset >> 9) << 9;                            /* Get current row size regarding to address */
        blockSize = CY_FLASH_SIZEOF_ROW - (tOffset - blockSize);    /* Calculate final length of the block which
                                                                       we can write to row */
        blockSize = (blockSize > tLength )? tLength : blockSize;

        /* Write 512 byte block */
        storeState = Cy_BLE_HAL_NvramWrite(tSrcPtr, (uint8_t *)(tOffset + CY_FLASH_BASE), blockSize);

        tSrcPtr += blockSize;
        tOffset += blockSize;
        tLength -= blockSize;
        
        /* For CY_BLE_STORE_DATA_MODE_NON_BLOCKING mode write one row per call */
        if(param->writeMode == CY_BLE_STORE_DATA_MODE_NON_BLOCKING)
        {
            if (storeState == CY_BLE_SUCCESS)
            {
                storeState = CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS;
            } 
            exitFlag = true;
        }
        
        /* Cy_BLE_ProcessEvents() allows BLE stack to process pending events */
        Cy_BLE_ProcessEvents();
    }
    
    return(storeState);
}


#if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))


/******************************************************************************
* Function Name: Cy_BLE_StoreBondingData
***************************************************************************//**
*
*  This function writes the new bonding data from RAM to the dedicated Flash
*  location as defined by the component. It performs data comparing between RAM
*  and Flash before writing to Flash. If there is no change between RAM and Flash
*  data, then no write is performed. It writes only one flash row in one call.
*  Application should keep calling this function till it returns CY_BLE_SUCCESS.
*  This function is available only when Bonding requirement is selected in
*  Security settings.
*
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*
*   Error Codes                           | Description
*   ----------------------------------    | ------------------------------------
*   CY_BLE_SUCCESS                        | On successful operation
    CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS   | Writing in progress
*   CY_BLE_ERROR_FLASH_WRITE_NOT_PERMITED | Flash Write is not permitted
*   CY_BLE_ERROR_FLASH_WRITE              | Error in flash Write
*
*  \globalvars
*   The cy_ble_pendingFlashWrite variable is used to detect status
*   of pending write to flash operation for stack data and CCCD.
*   This function automatically clears pending bits after write operation
*   complete.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_StoreBondingData(void)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

    /* Store Stack data */
    if((cy_ble_pendingFlashWrite & CY_BLE_PENDING_STACK_FLASH_WRITE_BIT) != 0u)
    {
        cy_stc_ble_stack_flash_param_t stackFlashParam =
        {
            .bitField = CY_BLE_PERSISTENT_BOND_LIST_BITMASK |
                        CY_BLE_PERSISTENT_RPA_LIST_BITMASK |
                        CY_BLE_PERSISTENT_WHITELIST_BITMASK
        };

        apiResult = Cy_BLE_StoreStackData(&stackFlashParam);
        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_pendingFlashWrite &= (uint8_t) ~CY_BLE_PENDING_STACK_FLASH_WRITE_BIT;
            
