ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.c
            /* Change apiResult if there are more pending data to store */
            if((cy_ble_pendingFlashWrite & CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT) != 0u)
            {
                apiResult = CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS;
            }
        }
    }
#if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
    
    /* Store CCCD values */
    if((apiResult == CY_BLE_SUCCESS) &&
       ((cy_ble_pendingFlashWrite & CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT) != 0u))
    {
        uint32_t i;
        cy_stc_ble_app_flash_param_t appFlashParam =
        {
            .buffLen = CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE,
        };

        /* Update CCCD values from RAM for active connections supporting bonding */
        for(i = 0u; i < CY_BLE_CONN_COUNT; i++)
        {
            if((Cy_BLE_GetConnectionState(cy_ble_connHandle[i]) >= CY_BLE_CONN_STATE_CONNECTED) &&
               (cy_ble_peerBonding[cy_ble_connHandle[i].attId] == CY_BLE_GAP_BONDING))
            {
                uint8_t cccdBlockCrc;
                appFlashParam.srcBuff = (uint8_t*)cy_ble_attValuesCccdMultiple[cy_ble_connHandle[i].attId];
                appFlashParam.destAddr = (uint8_t*)cy_ble_configPtr->flashStorage->attValuesCCCDFlashMemory
                                         [cy_ble_connHandle[i].bdHandle];

                /* Calculate CRC for CCCD block */
                cccdBlockCrc = Cy_BLE_HAL_CalcCRC8(cy_ble_attValuesCccdMultiple[cy_ble_connHandle[i].attId], 
                                                   CY_BLE_GATT_DB_CCCD_COUNT);
                /* Store new CRC value */                    
                cy_ble_attValuesCccdMultiple[cy_ble_connHandle[i].attId][CY_BLE_GATT_DB_CCCD_COUNT] = cccdBlockCrc;
                
                apiResult = Cy_BLE_StoreAppData(&appFlashParam);
                if(apiResult != CY_BLE_SUCCESS)
                {
                    break;
                }
            }
        }
        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_pendingFlashWrite &= (uint8_t) ~CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
        }
    }

    /* Clear requested CCCD values */
    if((apiResult == CY_BLE_SUCCESS) &&
       ((cy_ble_pendingFlashWrite & CY_BLE_PENDING_CCCD_FLASH_CLEAR_MASK) != 0u))
    {
        if((cy_ble_pendingFlashWrite & CY_BLE_PENDING_CCCD_FLASH_CLEAR_ALL_BIT) != 0u)
        {
            /* Remove CCCD values for all bonded devices */
            uint8_t defaultValuesCCCD[CY_BLE_MAX_BONDED_DEVICES + CY_BLE_CONN_COUNT][CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE];
            cy_stc_ble_app_flash_param_t appFlashParam =
            {
                .srcBuff  = (uint8_t*)defaultValuesCCCD,
                .destAddr = (uint8_t*)cy_ble_configPtr->flashStorage->attValuesCCCDFlashMemory,
                .buffLen  = sizeof(defaultValuesCCCD),
            };

            (void)memset(defaultValuesCCCD, 0, sizeof(defaultValuesCCCD));

            apiResult = Cy_BLE_StoreAppData(&appFlashParam);
            if(apiResult == CY_BLE_SUCCESS)
            {
                cy_ble_pendingFlashWrite &= (uint8_t) ~CY_BLE_PENDING_CCCD_FLASH_CLEAR_ALL_BIT;
            }
        }
        else /* Remove CCCD values for particular device */
        {
            uint8_t defaultValuesCCCD[CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE] = { 0u };
            cy_stc_ble_app_flash_param_t appFlashParam =
            {
                .srcBuff  = (uint8_t*)defaultValuesCCCD,
                .destAddr = (uint8_t*)cy_ble_configPtr->flashStorage->
                             attValuesCCCDFlashMemory[cy_ble_pendingFlashClearCccdHandle],
                .buffLen  = CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE,
            };

            apiResult = Cy_BLE_StoreAppData(&appFlashParam);
            if(apiResult == CY_BLE_SUCCESS)
            {
                cy_ble_pendingFlashWrite &= (uint8_t) ~CY_BLE_PENDING_CCCD_FLASH_CLEAR_BIT;
            }
        }
    }
#endif /* CY_BLE_GATT_DB_CCCD_COUNT != 0u */
    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_GAP_RemoveBondedDevice
***************************************************************************//**
*
*  This function marks the device untrusted. It removes the bonding information
*  of the device including CCCD values. This function removes device from the
*  white list also when auto-populate white list with bonded devices option is
*  enabled.
*
*  This function is available only when Bonding requirement is selected in
*  Security settings.
*
*  \param bdAddr: Pointer to peer device address, of type cy_stc_ble_gap_bd_addr_t.
*                 If device address is set to 0, then all devices shall be
*                 removed from trusted list and white list.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                       | Description
*   --------------------------------- | ------------------------------------
*   CY_BLE_SUCCESS                    | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER    | On specifying NULL as input parameter for 'bdAddr'.
*   CY_BLE_ERROR_INVALID_OPERATION    | Whitelist is already in use or there is pending write to flash operation.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY     | Device does not exist in the bond list.
*
*  \globalvars
*   The bdHandle is set in cy_ble_pendingFlashWrite variable to indicate that
*   data should be stored to flash by Cy_BLE_StoreBondingData afterwards.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_RemoveBondedDevice(cy_stc_ble_gap_bd_addr_t* bdAddr)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    cy_stc_ble_gap_peer_addr_info_t peerAddrInfoParam;

    if(cy_ble_pendingFlashWrite == 0u)
    {
    #if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
        /* Request to clear CCCD values which will be done by Cy_BLE_StoreBondingData() */
        cy_stc_ble_gap_bd_addr_t invalidBdAddr = { { 0u, 0u, 0u, 0u, 0u, 0u }, 0u };

        if(memcmp(((uint8_t*)&(bdAddr->bdAddr)), ((uint8_t*)&(invalidBdAddr.bdAddr)), CY_BLE_GAP_BD_ADDR_SIZE) == 0u)
        {
            /* Request to remove all bonded devices by Cy_BLE_StoreBondingData() */
            cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_CLEAR_ALL_BIT;
        }
        else
        {
            /* Get the BD handle from Address */
            peerAddrInfoParam.bdAddr = *bdAddr;
            apiResult = Cy_BLE_GAP_GetPeerBdHandle(&peerAddrInfoParam);
            if(apiResult == CY_BLE_SUCCESS)
            {
                /* Store BD handle to clear CCCD values by Cy_BLE_StoreBondingData() */
                cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_CLEAR_BIT;
                cy_ble_pendingFlashClearCccdHandle = peerAddrInfoParam.bdHandle;
            }
        }
    #endif /* CY_BLE_GATT_DB_CCCD_COUNT != 0u */
        if(apiResult == CY_BLE_SUCCESS)
        {
            apiResult = Cy_BLE_GAP_RemoveDeviceFromBondList(bdAddr);
        }
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }

    return(apiResult);
}


#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */


#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)

