ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.c
/******************************************************************************
 *  Function Name: Cy_BLE_GAPP_StartAdvertisement
 ***************************************************************************//**
 *
 *  This function is used to start the advertisement using the advertisement data
 *  set in the component customizer's GUI indicated by the advertisingParamIndex.
 *  After invoking this function, the device will be available for connection by
 *  the devices configured for GAP central role. It is only included if the
 *  device is configured for GAP Peripheral or GAP Peripheral + Central role.
 *
 *  On start of advertisement, GAP Peripheral receives the
 *  CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP event. The following events are
 *  possible on invoking this function:
 *
 *  * CY_BLE_EVT_GAP_DEVICE_CONNECTED - If the device connects to a GAP Central and
 *     Link Layer Privacy is disabled in component customizer.
 *  * CY_BLE_EVT_GAP_ENHANCE_CONN_COMPLETE - If the device connects to a GAP Central and
 *     Link Layer Privacy is enabled in component customizer.
 *  * CY_BLE_EVT_TIMEOUT: If no device in GAP Central mode connects to this
 *                       device within the specified timeout limit. Stack
 *                       automatically initiate stop advertising when Slow
 *                       advertising was initiated, or starts Slow advertising
 *                       after Fast advertising timeout occur.
 *  * CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP: If device started or stopped
 *                       advertising. Use Cy_BLE_GetAdvertisementState()to
 *                       determine the state. Sequential advertising could be
 *                       started when CY_BLE_ADV_STATE_STOPPED state is returned.
 *
 *  \param advertisingIntervalType: Fast or slow advertising interval with timings
 *                                 entered in Advertising settings section of the
 *                                 customizer.
 *  * CY_BLE_ADVERTISING_FAST   0x00u
 *  * CY_BLE_ADVERTISING_SLOW   0x01u
 *  * CY_BLE_ADVERTISING_CUSTOM 0x02u
 *
 *  \param advertisingParamIndex: The index of the peripheral and broadcast
 *                                configuration in customizer. For example:
 *  * CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX     0x00
 *  * CY_BLE_BROADCASTER_CONFIGURATION_0_INDEX    0x01
 *
 * \return
 *  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
 *  failed. The following are possible error codes.
 *
 *   Error Codes                       |  Description
 *   --------------------------------- |  --------------------------------
 *   CY_BLE_SUCCESS                    |  On successful operation.
 *   CY_BLE_ERROR_INVALID_PARAMETER    |  On passing an invalid parameter.
 *   CY_BLE_ERROR_INVALID_STATE        |  On calling this function not in Stopped state.
 *   CY_BLE_ERROR_INVALID_OPERATION    |  The operation is not permitted due to connection
 *                                     |  limit exceeded. 
 *
 *******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPP_StartAdvertisement(uint8_t advertisingIntervalType,
                                                      uint8_t advertisingParamIndex)
{
    cy_en_ble_api_result_t apiResult;

    if((advertisingIntervalType > CY_BLE_ADVERTISING_CUSTOM) || (advertisingParamIndex >= CY_BLE_GAPP_CONF_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
#if (CY_BLE_GAP_ROLE_PERIPHERAL) 
    else if((Cy_BLE_GetNumOfActiveConn() == CY_BLE_CONN_COUNT) && 
            ((cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advParam->advType <
                CY_BLE_GAPP_SCANNABLE_UNDIRECTED_ADV) ||
             (cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advParam->advType >
                CY_BLE_GAPP_NON_CONNECTABLE_UNDIRECTED_ADV)))
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
#endif /*CY_BLE_GAP_ROLE_PERIPHERAL */
    else if(Cy_BLE_GetAdvertisementState() == CY_BLE_ADV_STATE_STOPPED)
    {
        cy_ble_advIndex = advertisingParamIndex;
        if(advertisingIntervalType == CY_BLE_ADVERTISING_FAST)
        {
            cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advTo =
                cy_ble_configPtr->gappAdvParams[advertisingParamIndex].fastAdvTimeOut;
            cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advParam->advIntvMin =
                cy_ble_configPtr->gappAdvParams[advertisingParamIndex].fastAdvIntervalMin;
            cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advParam->advIntvMax =
                cy_ble_configPtr->gappAdvParams[advertisingParamIndex].fastAdvIntervalMax;
        }
        else if(advertisingIntervalType == CY_BLE_ADVERTISING_SLOW)
        {
            cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advTo =
                cy_ble_configPtr->gappAdvParams[advertisingParamIndex].slowAdvTimeOut;
            cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advParam->advIntvMin =
                cy_ble_configPtr->gappAdvParams[advertisingParamIndex].slowAdvIntervalMin;
            cy_ble_configPtr->discoveryModeInfo[advertisingParamIndex].advParam->advIntvMax =
                cy_ble_configPtr->gappAdvParams[advertisingParamIndex].slowAdvIntervalMax;
        }
        else /* Do not update advertising intervals */
        {
        }
        cy_ble_advertisingIntervalType = advertisingIntervalType;
        apiResult = Cy_BLE_GAPP_EnterDiscoveryMode(&cy_ble_configPtr->discoveryModeInfo[cy_ble_advIndex]);

        if(apiResult == CY_BLE_SUCCESS)
        {
            Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_ADV_INITIATED);
        }
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_GAPP_StopAdvertisement
***************************************************************************//**
*
*   This function can be used to exit from discovery mode. After the execution
*   of this function, there will no longer be any advertisements. On stopping
*   advertising, GAP Peripheral receives CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP
*   event. It is expected that the application layer tracks the function call
*   performed before occurrence of this event as this event can occur on making
*   a call to Cy_BleGappStartAdvertisement(), Cy_BLE_GAPP_EnterDiscoveryMode(),
*   or Cy_BLE_GAPP_StartAdvertisement() functions as well.
*
*   The following event occurs on invoking this function:
*   * CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                           | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INVALID_STATE            | On calling this function not in Advertising state.
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPP_StopAdvertisement(void)
{
    cy_en_ble_api_result_t apiResult;

    if(Cy_BLE_GetAdvertisementState() != CY_BLE_ADV_STATE_STOPPED)
    {
        apiResult = Cy_BLE_GAPP_ExitDiscoveryMode();
        if(apiResult == CY_BLE_SUCCESS)
        {
            Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_STOP_INITIATED);
        }
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }

    return(apiResult);
}


