ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.c
/******************************************************************************
* Function Name: Cy_BLE_ChangeAdDeviceAddress
***************************************************************************//**
*
*  This function is used to set the Bluetooth device address into the
*  advertisement or scan response data structures.
*
*  \param bdAddr: Bluetooth Device address. The variable is of type cy_stc_ble_gap_bd_addr_t.
*  \param dest: 0 - selects advertisement structure, not zero value selects scan
*               response structure.
*
* \return
*  None
*
*******************************************************************************/
void Cy_BLE_ChangeAdDeviceAddress(const cy_stc_ble_gap_bd_addr_t* bdAddr,
                                  uint8_t dest)
{
    uint32_t i;
    uint32_t fFlag;
    uint32_t adLength;
    uint32_t byteCounter;
    uint32_t maxLength;
    uint32_t advIndex = 0u;
    uint8_t *destBuffer;

    do
    {
        fFlag = 0u;
        byteCounter = 0u;

        if(dest == 0u)      /* Destination - advertising structure */
        {
            destBuffer = cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advData;
            maxLength = cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advDataLen;
        }
        else                /* Destination - scan response structure */
        {
            destBuffer = cy_ble_configPtr->discoveryModeInfo[advIndex].scanRspData->scanRspData;
            maxLength = cy_ble_configPtr->discoveryModeInfo[advIndex].scanRspData->scanRspDataLen;
        }

        while((byteCounter < maxLength) && (fFlag == 0u))
        {
            adLength = destBuffer[byteCounter];

            if(adLength != 0u)
            {
                /* Increment byte counter so it can point to AD type */
                byteCounter++;

                if(destBuffer[byteCounter] == CY_BLE_ADV_DEVICE_ADDR)
                {
                    /* Start of the device address type was found. Set flag and exit the loop. */
                    fFlag = 1u;
                }
                else
                {
                    byteCounter += adLength;
                }
            }
            else
            {
                /* The end of advertisement data structure was encountered though exit the loop. */
                break;
            }
        }

        if(fFlag != 0u)
        {
            /* Increment byte counter so it can point to Device address */
            byteCounter++;

            /* Update Device Address type */
            destBuffer[byteCounter] = bdAddr->type;

            for(i = 0u; i < CY_BLE_GAP_BD_ADDR_SIZE; i++)
            {
                destBuffer[byteCounter + i + 1u] = bdAddr->bdAddr[i];
            }
        }
        advIndex++;
    }
    while(advIndex < CY_BLE_GAPP_CONF_COUNT);
}

#endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER */


#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)

/******************************************************************************
* Function Name: Cy_BLE_GAPC_StartScan
***************************************************************************//**
*
*   This function is used for discovering GAP peripheral devices that are
*   available for connection. It performs the scanning routine using the
*   parameters entered in the component's customizer indicated by
*   scanParamIndex parameter.
*
*   As soon as the discovery operation starts, CY_BLE_EVT_GAPC_SCAN_START_STOP
*   event is generated. The CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT event is
*   generated when a GAP peripheral device is located. There are three discovery
*   procedures can be selected in the customizer's GUI:
*
*   * Observation procedure: A device performing the observer role receives only
*                            advertisement data from devices irrespective of
*                            their discoverable mode settings. Advertisement
*                            data received is provided by the event,
*                            CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT. This procedure
*                            requires the scanType sub parameter to be passive
*                            scanning.
*
*   * Discovery procedure: A device performing the discovery procedure receives
*                          the advertisement data and scan response data from
*                          devices in both limited discoverable mode and the
*                          general discoverable mode. Received data is provided
*                          by the event, CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT.
*                          This procedure requires the scanType sub-parameter
*                          to be active scanning.
*
*   Every Advertisement / Scan response packet is received in a new event,
*   CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT.
*   If 'scanTo' sub-parameter is a non-zero value, then upon commencement of
*   discovery procedure and elapsed time = 'scanTo', CY_BLE_EVT_TIMEOUT event
*   is generated with the event parameter indicating CY_BLE_GAP_SCAN_TO.
*   Possible generated events are:
*   * CY_BLE_EVT_GAPC_SCAN_START_STOP: If a device started or stopped scanning.
*                                     Use Cy_BLE_GetScanState() to determine the
*                                     state. Sequential scanning could be
*                                     started when CY_BLE_ADV_STATE_STOPPED
*                                     state is returned.
*   * CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT
*   * CY_BLE_EVT_TIMEOUT (CY_BLE_GAP_SCAN_TO)
*
*   \param scanningIntervalType:  Fast or slow scanning interval with
*       timings entered in Scan settings section of the customizer.
*       * CY_BLE_SCANNING_FAST   0x00u
*       * CY_BLE_SCANNING_SLOW   0x01u
*       * CY_BLE_SCANNING_CUSTOM 0x02u
*
*  \param scanParamIndex:  The index of the central and scan configuration
*                          in customizer.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                        | Description
*   ---------------------------------- | -----------------------------------
*   CY_BLE_SUCCESS                     | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER     | On passing an invalid parameter.
*   CY_BLE_ERROR_INVALID_STATE         | On calling this function not in Stopped state.
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_StartScan(uint8_t scanningIntervalType,
                                             uint8_t scanParamIndex)
{
    cy_en_ble_api_result_t apiResult;

