ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.c
    if(scanningIntervalType > CY_BLE_SCANNING_CUSTOM)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(Cy_BLE_GetScanState() == CY_BLE_SCAN_STATE_STOPPED)
    {
        cy_ble_scanIndex = scanParamIndex;
        if(scanningIntervalType == CY_BLE_SCANNING_FAST)
        {
            cy_ble_configPtr->discoveryInfo[scanParamIndex].scanTo =
                cy_ble_configPtr->gapcScanParams[scanParamIndex].fastScanTimeOut;
            cy_ble_configPtr->discoveryInfo[scanParamIndex].scanIntv =
                cy_ble_configPtr->gapcScanParams[scanParamIndex].fastScanInterval;
            cy_ble_configPtr->discoveryInfo[scanParamIndex].scanWindow =
                cy_ble_configPtr->gapcScanParams[scanParamIndex].fastScanWindow;
        }
        else if(scanningIntervalType == CY_BLE_SCANNING_SLOW)
        {
            cy_ble_configPtr->discoveryInfo[scanParamIndex].scanTo =
                cy_ble_configPtr->gapcScanParams[scanParamIndex].slowScanTimeOut;
            cy_ble_configPtr->discoveryInfo[scanParamIndex].scanIntv =
                cy_ble_configPtr->gapcScanParams[scanParamIndex].slowScanInterval;
            cy_ble_configPtr->discoveryInfo[scanParamIndex].scanWindow =
                cy_ble_configPtr->gapcScanParams[scanParamIndex].slowScanWindow;
        }
        else /* Do not update scanning intervals */
        {
        }

        cy_ble_scanningIntervalType = scanningIntervalType;
        apiResult = Cy_BLE_GAPC_StartDiscovery(&cy_ble_configPtr->discoveryInfo[scanParamIndex]);

        if(apiResult == CY_BLE_SUCCESS)
        {
            Cy_BLE_SetScanState(CY_BLE_SCAN_STATE_SCAN_INITIATED);
        }
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_GAPC_StopScan
***************************************************************************//**
*
*   This function used to stop the discovery of devices. On stopping discovery
*   operation, CY_BLE_EVT_GAPC_SCAN_START_STOP event is generated. Application
*   layer needs to keep track of the function call made before receiving this
*   event to associate this event with either the start or stop discovery
*   function.
*
*   Possible events generated are:
*    * CY_BLE_EVT_GAPC_SCAN_START_STOP
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                           | Description
*   ------------------------------------- | -----------------------------------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INVALID_STATE            | On calling this function not in Scanning state.
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_StopScan(void)
{
    cy_en_ble_api_result_t apiResult;

    if(Cy_BLE_GetScanState() == CY_BLE_SCAN_STATE_SCANNING)
    {
        apiResult = Cy_BLE_GAPC_StopDiscovery();
        if(apiResult == CY_BLE_SUCCESS)
        {
            Cy_BLE_SetScanState(CY_BLE_SCAN_STATE_STOP_INITIATED);
        }
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }

    return(apiResult);
}


#endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER */


#if (CY_BLE_GAP_ROLE_CENTRAL)

/******************************************************************************
* Function Name: Cy_BLE_GAPC_ConnectDevice
***************************************************************************//**
*
*  This function is used to send a connection request to the remote device with
*  the connection parameters set in the component customizer. This function needs
*  to be called only once after the target device is discovered by
*  Cy_BLE_GAPC_StartScan() and further scanning has stopped. Scanning is
*  successfully stopped on invoking Cy_BLE_GAPC_StopScan() and then receiving the
*  event CY_BLE_EVT_GAPC_SCAN_START_STOP with sub-parameter 'success' = 0x01u.
*
*  On successful connection, the following events are generated at the GAP
*  Central device (as well as the GAP Peripheral device), in the following order.
*  * CY_BLE_EVT_GATT_CONNECT_IND
*  * CY_BLE_EVT_GAP_DEVICE_CONNECTED - If the device connects to a GAP Central and
*    Link Layer Privacy is disabled in component customizer.
*  * CY_BLE_EVT_GAP_ENHANCE_CONN_COMPLETE - If the device connects to a GAP Central and
*    Link Layer Privacy is enabled in component customizer.
*  * CY_BLE_EVT_GAP_DEVICE_CONNECTED
*
*  A procedure is considered to have timed out if a connection response packet is
*  not received within time set by cy_ble_connectingTimeout global variable
*  (30 seconds by default). CY_BLE_EVT_TIMEOUT event with CY_BLE_GENERIC_APP_TO parameter
*  will indicate about connection procedure timeout. Connection will automatically
*  be canceled and state will be changed to CY_BLE_STATE_ON.
*
*  \param address: The device address of the remote device to connect to.
*  \param centralParamIndex: The index of the central configuration in customizer.
*    For example:
*  * CY_BLE_CENTRAL_CONFIGURATION_0_INDEX    0x00
*  * CY_BLE_CENTRAL_CONFIGURATION_1_INDEX    0x01
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                       | Description
*   ------------                      | -----------
*   CY_BLE_SUCCESS                    | On successful operation.
*   CY_BLE_ERROR_STACK_INTERNAL       | On error occurred in the BLE stack.
*   CY_BLE_ERROR_INVALID_PARAMETER    | On passing an invalid parameter.
*   CY_BLE_ERROR_INVALID_STATE        | On calling this function not in Disconnected state.
*   CY_BLE_ERROR_INVALID_OPERATION    | The operation is not permitted due to connection
*                                     | limit exceeded. 
*
*   Note: Please refer the description of Cy_BLE_GAPC_InitConnection() for recommended
*   Connection Interval values.
*
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_ConnectDevice(const cy_stc_ble_gap_bd_addr_t * address,
                                                 uint8_t centralParamIndex)
{   
#if (CY_BLE_GAP_ROLE_PERIPHERAL)
    cy_en_ble_adv_state_t advState = Cy_BLE_GetAdvertisementState();
#endif /* CY_BLE_GAP_ROLE_PERIPHERAL */

    cy_en_ble_api_result_t apiResult;
    uint32_t i;

    if(Cy_BLE_GetState() != CY_BLE_STATE_ON)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if(address == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(Cy_BLE_GetNumOfActiveConn() == CY_BLE_CONN_COUNT)
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
#if (CY_BLE_GAP_ROLE_PERIPHERAL)
    else if(((CY_BLE_CONN_COUNT - Cy_BLE_GetNumOfActiveConn()) == 1u) && (advState == CY_BLE_ADV_STATE_ADVERTISING) && 
            ((cy_ble_configPtr->discoveryModeInfo[cy_ble_advIndex].advParam->advType < 
                CY_BLE_GAPP_SCANNABLE_UNDIRECTED_ADV) ||
             (cy_ble_configPtr->discoveryModeInfo[cy_ble_advIndex].advParam->advType > 
                CY_BLE_GAPP_NON_CONNECTABLE_UNDIRECTED_ADV)))
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
#endif /* CY_BLE_GAP_ROLE_PERIPHERAL */
    else
    {
        /* Init default connection parameters.
         * Application may change it before initiating a connection */
        cy_ble_connectionParameters.scanIntv = cy_ble_configPtr->discoveryInfo[centralParamIndex].scanIntv;
        cy_ble_connectionParameters.scanWindow = cy_ble_configPtr->discoveryInfo[centralParamIndex].scanWindow;
        cy_ble_connectionParameters.ownAddrType = cy_ble_configPtr->discoveryInfo[centralParamIndex].ownAddrType;
        cy_ble_connectionParameters.initiatorFilterPolicy =
            cy_ble_configPtr->discoveryInfo[centralParamIndex].scanFilterPolicy;
        cy_ble_connectionParameters.connIntvMin =
            cy_ble_configPtr->gapcScanParams[centralParamIndex].gapcConnectionIntervalMin;
        cy_ble_connectionParameters.connIntvMax =
            cy_ble_configPtr->gapcScanParams[centralParamIndex].gapcConnectionIntervalMax;
        cy_ble_connectionParameters.connLatency =
            cy_ble_configPtr->gapcScanParams[centralParamIndex].gapcConnectionSlaveLatency;
        cy_ble_connectionParameters.supervisionTO =
            cy_ble_configPtr->gapcScanParams[centralParamIndex].gapcConnectionTimeOut;
        cy_ble_connectionParameters.minCeLength = 0x0000u;
        cy_ble_connectionParameters.maxCeLength = 0xFFFFu;
        cy_ble_connectingTimeout.timeout = CY_BLE_GAPC_CONNECTING_TIMEOUT;

        for(i = 0u; i < CY_BLE_GAP_BD_ADDR_SIZE; i++)
        {
            cy_ble_connectionParameters.peerBdAddr[i] = address->bdAddr[i];
        }
        cy_ble_connectionParameters.peerAddrType = address->type;

        apiResult = Cy_BLE_StartTimer(&cy_ble_connectingTimeout);

        if(apiResult == CY_BLE_SUCCESS)
        {
            apiResult = Cy_BLE_GAPC_InitConnection(&cy_ble_connectionParameters);

            if(apiResult == CY_BLE_SUCCESS)
            {
                Cy_BLE_SetState(CY_BLE_STATE_CONNECTING);
            }
        }
        else
        {
            (void)Cy_BLE_StopTimer(&cy_ble_connectingTimeout);
        }
    }

    return(apiResult);
}


