ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.c
/******************************************************************************
* Function Name: Cy_BLE_GAPC_CancelDeviceConnection
***************************************************************************//**
*
*  This function cancels a previously initiated connection with the remote
*  device. It is a blocking function. No event is generated on calling this
*  function. If the devices are already connected then this function should not
*  be used. If you intend to disconnect from an existing connection, the function
*  Cy_BLE_GAP_Disconnect() should be used.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                         | Description
*   ----------------------------------- | --------------------------------------
*   CY_BLE_SUCCESS                      | On successful operation.
*   CY_BLE_ERROR_STACK_INTERNAL         | An error occurred in the BLE stack.
*   CY_BLE_ERROR_INVALID_STATE          | On calling this function not in Connecting state.
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_CancelDeviceConnection(void)
{
    cy_en_ble_api_result_t apiResult;

    if(Cy_BLE_GetState() != CY_BLE_STATE_CONNECTING)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else
    {
        apiResult = Cy_BLE_GAPC_CancelConnection();

        if(cy_ble_connectingTimeout.timeout != 0u)
        {
            (void)Cy_BLE_StopTimer(&cy_ble_connectingTimeout);
        }

        if(apiResult == CY_BLE_SUCCESS)
        {
            Cy_BLE_SetState(CY_BLE_STATE_ON);
        }
    }

    return(apiResult);
}

#endif /* CY_BLE_GAP_ROLE_CENTRAL */


#if (CY_BLE_GATT_ROLE_SERVER)

#if (CY_BLE_GAP_ROLE_PERIPHERAL)

/******************************************************************************
* Function Name: Cy_BLE_ChangeAdLocalName
***************************************************************************//**
*  This function is used to set the local device name in the advertisement or scan
*  response data structure.
*
*  \param name: The local device name string to be set in advertisement data
*            structure.
*  \param dest: 0 - advertisement structure, not zero value selects scan response
*              structure.
*
* \return
*  None
*
*******************************************************************************/
static void Cy_BLE_ChangeAdLocalName(const char8 name[],
                                     uint8_t dest)
{
    uint32_t i;
    uint8_t fFlag;
    uint8_t adLength;
    uint8_t byteCounter;
    uint8_t *destBuffer;
    uint8_t maxLength;
    uint8_t advIndex = 0u;

    do
    {
        fFlag = 0u;
        adLength = 0u;
        byteCounter = 0u;

        if(dest == 0u)      /* Destination - advertising structure */
        {
            destBuffer = cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advData;
            maxLength = cy_ble_configPtr->discoveryModeInfo[advIndex].advData->advDataLen;
        }
        else                /* Destination - scan response structure */
        {
            destBuffer = cy_ble_configPtr->discoveryModeInfo[advIndex].scanRspData->scanRspData;
            maxLength = cy_ble_configPtr->discoveryModeInfo[advIndex].scanRspData->scanRspDataLen;
        }

        while((byteCounter < maxLength) && (fFlag == 0u))
        {
            adLength = destBuffer[byteCounter];

            if(adLength != 0u)
            {
                /* Increment byte counter so it can point to AD type */
                byteCounter++;

                if((CY_BLE_SHORT_LOCAL_NAME == destBuffer[byteCounter]) ||
                   (CY_BLE_COMPLETE_LOCAL_NAME == destBuffer[byteCounter]))
                {
                    /* Start of the Local Name AD type was found. Set flag and exit the loop. */
                    fFlag = 1u;
                }
                else
                {
                    byteCounter += adLength;
                }
            }
            else
            {
                /* The end of advertisement data structure was encountered though exit the loop. */
                break;
            }
        }

        if(fFlag != 0u)
        {
            /* Reuse "adLength" to hold location of the last character of local name in
             * AD structure. */
            adLength += byteCounter;

            /* Increment byte counter to point to start of the local Name string */
            byteCounter++;

            for(i = byteCounter; ((i < (adLength)) && (name[i - byteCounter] != CY_BLE_NULL_CHARCTER)); i++)
            {
                destBuffer[i] = (uint8_t)name[i - byteCounter];
            }

            /* This loop handles the case when new local name is shorter than old one.
             * In this case all remaining characters should be null characters. */
            while(adLength > i)
            {
                /* Terminate string */
                destBuffer[i] = (uint8_t)CY_BLE_NULL_CHARCTER;
                i++;
            }
        }
        advIndex++;
    }
    while(advIndex < CY_BLE_GAPP_CONF_COUNT);
}

#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL) */


/******************************************************************************
 * Function Name: Cy_BLE_SetLocalName
 ***************************************************************************//**
 *  This function is used to set the local device name - a Characteristic of the
 *  GAP Service. If the characteristic length entered in the component customizer
 *  is shorter than the string specified by the "name" parameter, the local device
 *  name will be cut to the length specified in the customizer.
 *
 *  \param name: The local device name string. The name string to be written as
 *              the local device name. It represents a UTF-8 encoded User
 *              Friendly Descriptive Name for the device. The length of the local
 *              device string is entered into the component customizer and it can
 *              be set to a value from 0 to 248 bytes. If the name contained in
 *              the parameter is shorter than the length from the customizer, the
 *              end of the name is indicated by a NULL octet (0x00).
 *
 * \return
 *  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
 *  failed. The following are possible error codes.
 *
 *   Error Codes                         | Description
 *   ------------                        | -----------
 *   CY_BLE_SUCCESS                      | The function completed successfully.
 *   CY_BLE_ERROR_INVALID_PARAMETER      | On specifying NULL as input parameter.
 *
 *******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_SetLocalName(const char8 name[])
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    uint32_t i;
    char8 *ptr;
    uint8_t charLen;

    if(NULL != name)
    {
        /* Get the pointer to the Device Name characteristic  */
        ptr = (char8*)CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_PTR(cy_ble_configPtr->gaps->deviceNameCharHandle);

        /* First need to get the maximum length of the characteristic data in the GATT
         *  database to make sure there is enough place for the data. The length
         *  can't be longer than 248, so only the LSB of 16 bit of length is to
         *  be used. */
        charLen = (uint8_t)CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(cy_ble_configPtr->gaps->deviceNameCharHandle);

        /* Copy name into characteristic */
        for(i = 0u; ((i < charLen) && (name[i] != CY_BLE_NULL_CHARCTER)); i++)
        {
            ptr[i] = name[i];
        }

        if(i < charLen)
        {
            /* Terminate string */
            ptr[i] = CY_BLE_NULL_CHARCTER;
        }

