ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_gap.c
        /* Update device name in advertising and scan response structure */
        #if (CY_BLE_GAP_ROLE_PERIPHERAL)
        Cy_BLE_ChangeAdLocalName(name, 0u);
        Cy_BLE_ChangeAdLocalName(name, 1u);
        #endif /* (CY_BLE_GAP_ROLE_PERIPHERAL) */
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_GetLocalName
***************************************************************************//**
*
*  This function is used to read the local device name - a Characteristic of
*  the GAP Service.
*
* \param name: The local device name string. Used to read the local name to the
*             given string array. It represents a UTF-8 encoded User Friendly
*             Descriptive Name for the device. The length of the local device
*             string is entered into the component customizer and it can be set
*             to a value from 0 to 248 bytes. If the name contained in the
*             parameter is shorter than the length from the customizer, the end
*             of the name is indicated by a NULL octet (0x00).
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                         | Description
*   ------------                        | -----------
*   CY_BLE_SUCCESS                      | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER      | On specifying NULL as input parameter.
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GetLocalName(char8 name[])
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    uint8_t charLen;
    uint32_t i;
    char8 *ptr;

    if(NULL != name)
    {
        /* Get the pointer to the Device Name characteristic  */
        ptr = (char8*)CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_PTR(cy_ble_configPtr->gaps->deviceNameCharHandle);

        /* First need to get the length of the characteristic data in the GATT
         *  database to make sure there is enough place for the data. The length
         *  can't be longer than 248, so only the LSB of 16 bit of length is to
         *  be used. */
        charLen = (uint8_t)CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_LEN(cy_ble_configPtr->gaps->deviceNameCharHandle);

        /* Copy name from characteristic */
        for(i = 0u; ((i < charLen) && (CY_BLE_NULL_CHARCTER != ptr[i])); i++)
        {
            name[i] = ptr[i];
        }

        /* Terminate string */
        name[i] = CY_BLE_NULL_CHARCTER;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }

    return(apiResult);
}

#endif /* (CY_BLE_GATT_ROLE_SERVER) */

#endif /* defined(CY_BLE_MODE_PROFILE) */
#ifdef __cplusplus
}
#endif /* __cplusplus */

/* [] END OF FILE */
